DataProcessors/АвтоматическоеЗакрытиеКассовыхСмен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>АвтоматическоеЗакрытиеКассовыхСмен</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СтатусыКасс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыКасс</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрышкаОткрыта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БумагаВставлена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/АвтоматическоеЗакрытиеКассовыхСмен/Ext/ObjectModule.bsl
Процедура РегламентноеВыполнение() Экспорт 
	ЗакрытьКассовыеСмены();	
КонецПроцедуры

Процедура ЗакрытьКассовыеСмены() Экспорт 
	
	ЗапросОткрытыхСмен = Новый Запрос;
	ЗапросОткрытыхСмен.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтатусыКассСрезПоследних.Касса,
	|	СтатусыКассСрезПоследних.Период,
	|	СтатусыКассСрезПоследних.СтатусСмены
	|ПОМЕСТИТЬ ВТ_Срез
	|ИЗ
	|	РегистрСведений.СтатусыКасс.СрезПоследних(&ТекДата, ) КАК СтатусыКассСрезПоследних
	|ГДЕ
	|	СтатусыКассСрезПоследних.Касса.ОбновлятьСтатусКассыССервера
	|	И НЕ СтатусыКассСрезПоследних.Касса.ИД = """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Срез.Касса
	|ИЗ
	|	ВТ_Срез КАК ВТ_Срез
	|ГДЕ
	|	(ВТ_Срез.СтатусСмены = ""opened""
	|			ИЛИ ВТ_Срез.СтатусСмены = ""expired"")"; 
	
	ЗапросОткрытыхСмен.УстановитьПараметр("ТекДата",ТекущаяДата());
		
	РезультатЗапросаОткрытыхСмен = ЗапросОткрытыхСмен.Выполнить(); 
	
	Если НЕ РезультатЗапросаОткрытыхСмен.Пустой() Тогда
		
		ВыборкаОткрытыхСмен = РезультатЗапросаОткрытыхСмен.Выбрать();
		
		Пока ВыборкаОткрытыхСмен.Следующий() Цикл
			
			КассаЗапроса = ВыборкаОткрытыхСмен.Касса;
			
			Кассир = Чеки.ПолучитьПользователяЗакрытияОткрытияСмены(КассаЗапроса);
			
			Если НЕ ЗначениеЗаполнено(Кассир) Тогда
				Кассир = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
			СтруктураВозврата = Чеки.ОткрытьЗакрытьСмену(КассаЗапроса, Истина, Кассир);
			
			Если СтруктураВозврата.Результат Тогда
				ЗаписьЖурналаРегистрации("Автоматическое закрытие кассовой смены", УровеньЖурналаРегистрации.Информация, , ,
				"Смена по кассе "+СокрЛП(КассаЗапроса)+" успешно закрыта."); 			
			Иначе
				ЗаписьЖурналаРегистрации("Автоматическое закрытие кассовой смены", УровеньЖурналаРегистрации.Ошибка, , ,
				"При закрытии смены по кассе "+СокрЛП(КассаЗапроса)+" произошла ошибка "+ СтруктураВозврата.Сообщение);  			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;	
	
КонецПроцедуры
